# How to calculate summary statistics?

Follow along with this [article](https://pandas.pydata.org/pandas-docs/stable/getting_started/intro_tutorials/06_calculate_statistics.html). The data set from the article has been included in the repository already, no need to download separately. This notebook will also contain some supplemental information to help you better understand basic summary statistics.

First thing we want to do is to import the pandas library.

In [32]:
import pandas as pd

We are going to be working with the titanic dataset found [here.](https://github.com/pandas-dev/pandas/blob/master/doc/data/titanic.csv) It is in csv format and consists fo the following data columns:


- PassengerId: Id of every passenger.
- Survived: Value of 0 for not survived and 1 for survived.
- Pclass: There are 3 classes: Class 1, Class 2 and Class 3.
- Name: Name of passenger.
- Sex: Gender of passenger.
- Age: Age of passenger.
- SibSp: Number of siblings / spouses on the Titanic
- Parch: Number of parents / children on the Titanic
- Ticket: Ticket number of passenger.
- Fare: Indicating the fare.
- Cabin: The cabin of passenger.
- Embarked: Port of Embarkation ( C = Cherbourg, Q = Queenstown, S = Southampton)

Let's load the data into a data frame and see what the data looks like. Since your csv file is in a folder named data, the path syntex is: data/your_data_set_name.csv to read your data into a data frame.

In [34]:
#read titantic data set into a data frame

titanic = pd.read_csv("data/titanic.csv")
#although we listed the column names above, write the code to return the name of all of your columns in the dataset

In [35]:
# print the first 5 rows from the dataframe
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

What are some of your observations from looking at the data so far? Questions you would like to explore?

What does "C" and "S" stand for in the "Embarked" Column. , what does the "SibSp" and "Parch" column mean? Does the listted clas impact survival rate

For example: I noticed that Survived is an int instead of Yes or No, not sure if I'll need to address that while data cleaning. I'm curious if the amount you paid for your ticket(Fare) impacted your survival rate?
<br><br><br><br><br>

In [40]:
#.info() returns: 

titanic.info()
    
#name of the column, Non-null Count meaning how many non-null values their are in that column and Dtype
#int64 means int value, float64 means float value, object means string value.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 66.2+ KB

By default statistical anaysis is run on numerical values.  

Looking at the data above what do you notice about Age? Cabin? Hint: It would appear we are missing some data. 
We are missing values for Age and Cabin, since hte Non-Null numbers for those columns do not match the row amount in the data.

How might these observations influence the questions asked? Missing data can skew the results, so questions should be geared towards using the data that is fully available, for the most accurate results. 

Any other observations?
there are 2 passenger data rows that were not marked on the embarked column- what can that mean?
<br><br><br>

## Aggregating statistics

### Calculating Mean, Median, Mode

#### Mean: is the sum of the values divided by the number of values.

In [41]:
#What is the mean age of the Titanic passengers?
titanic["Age"].mean()

## Age Mean = 29.69911764705882

29.69911764705882

We can also get the mean for all columns.

In [42]:
#mean for all columns
titanic.mean()

<ipython-input-42-b258a1f835b5>:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  titanic.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

#### Median: Is the middle value when all the numbers are put in order, dividing the sample into two halves.  

Example: (23, 46, 55, 78, 99)<br> 
The Median of the above example is 55.

In [46]:
# What is the median age and ticket fare price of the Titanic passengers?
titanic[["Age", "Fare"]].median()
# Age     28.0000
# Fare    14.4542

Age     28.0000
Fare    14.4542
dtype: float64

#### Mode: The most frequent value(s) in a sample

In [47]:
# What is the mode age and fare for the titanic dateset?
titanic[["Age", "Fare"]].mode()
#Age: 24.0  Fare:8.05

    Age  Fare
0  24.0  8.05

Note the difference between Mean, Medium and Mode.  Why is this important? Can you think of times you would what to use one over the others?<br><br><br><br><br>
Mean= Average
Median = the middle number, after the numbers are consecutively ordered
Mode= the number that most frequents the sequences

Each of these can be useful when analyzing data sets, depending on the situation. If I'm trying to find the average of age of a consumer for a certain product, I would use Mean so that I could assertain the demographic that is most likely to buy that product and focus on trends within that target audience. 

If I were trying to find the most accurate salary for a multi-level marketing rank- I would use the Median values, as those can be heavily skewed by absurdly high outliers, or a multitude of people that make 0. A median would provide a more likely outcome than the few percentages of people that make massive amounts more than the rest.

I would use Mode if I were to try to find the most used value, wether it were most common price, size, or other value of something in the data set.

We can use the .describe() funciton to display some basic statistics for all numeric columns:

In [79]:
# Summary statistics for all columns in a dataset

titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [80]:
# Summary statistics for just the Age and Fare columns
titanic[["Age", "Fare"]].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

Notice that medium and mode are not included in .describe()

Instead of the predefined statistics, specific combinations of aggregating statistics for given columns can be defined using the [DataFrame.agg() method:](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html#pandas.DataFrame.agg)

In [81]:
#use .agg

titanic.agg(
    {
        "Age": ["min", "max", "median", "skew"],
        "Fare": ["min", "max", "median", "mean"],
    }
)

              Age        Fare
min      0.420000    0.000000
max     80.000000  512.329200
median  28.000000   14.454200
skew     0.389108         NaN
mean          NaN   32.204208

## Aggregating statistics grouped by category

Calculating a given statistic (e.g. mean age) for each category in a column (e.g. male/female in the Sex column) is a common pattern. The groupby method is used to support this type of operations.

In [82]:
# What is the average age for male versus female Titanic passengers?
titanic[["Sex", "Age"]].groupby("Sex").mean()

              Age
Sex
female  27.915709
male    30.726645

In [83]:
# What is the survival of men verses female Titanic Passengers? 
titanic[["Sex", "Age"]].groupby("Sex").mean(numeric_only=True)

              Age
Sex
female  27.915709
male    30.726645

In [84]:
# Try some other combinations, what do you think about this method?

titanic.groupby("Fare").mean(numeric_only=True)

          PassengerId  Survived    Pclass        Age  SibSp     Parch
Fare
0.0000         516.40  0.066667  1.933333  35.142857   0.00  0.000000
4.0125         379.00  0.000000  3.000000  20.000000   0.00  0.000000
5.0000         873.00  0.000000  1.000000  33.000000   0.00  0.000000
6.2375         327.00  0.000000  3.000000  61.000000   0.00  0.000000
6.4375         844.00  0.000000  3.000000  34.500000   0.00  0.000000
...               ...       ...       ...        ...    ...       ...
227.5250       589.25  0.750000  1.000000  32.666667   0.25  0.000000
247.5208       209.50  0.500000  1.000000  37.000000   0.00  1.000000
262.3750       527.50  1.000000  1.000000  19.500000   2.00  2.000000
263.0000       224.50  0.500000  1.000000  32.500000   2.50  2.500000
512.3292       559.00  1.000000  1.000000  35.333333   0.00  0.333333

[248 rows x 6 columns]

In the previous examples, we explicitly selected the 2 columns first. If not, the mean method is applied to each column containing numerical columns:

In [85]:
#use .groupby Sex and .mean
titanic.groupby("Sex").mean(numeric_only=True)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

It does not make much sense to get the average value of the Pclass. if we are only interested in the average age for each gender, the selection of columns (rectangular brackets [] as usual) is supported on the grouped data as well:

In [86]:
#use .goupby Sex just for Age 
titanic.groupby("Sex")["Age"].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [87]:
# What is the mean ticket fare price for each of the sex and cabin class combinations?
titanic.groupby(["Sex","Cabin"])["Fare"].mean()

Sex     Cabin
female  A16      39.6000
        B18      57.9792
        B20      57.0000
        B22      71.0000
        B28      80.0000
                  ...
male    F G73     7.6500
        F2       26.0000
        F38       7.7500
        F4       39.0000
        T        35.5000
Name: Fare, Length: 171, dtype: float64

In [90]:
# Try some other combinations, what do you think about this method?

titanic.groupby(["Sex", "Fare"])["Survived"].mean()

Sex     Fare
female  6.7500      0.0
        7.2250      1.0
        7.2292      1.0
        7.2500      1.0
        7.4958      1.0
                   ...
male    221.7792    0.0
        227.5250    0.0
        247.5208    0.0
        263.0000    0.0
        512.3292    1.0
Name: Survived, Length: 349, dtype: float64

## Count number of records by category

The value_counts() method counts the number of records for each category in a column.

In [91]:
# What is the number of passengers in each of the cabin classes?
titanic["Pclass"].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

The function is a shortcut, as it is actually a groupby operation in combination with counting of the number of records within each group:

In [92]:
#Count the number of passengers by cabin classes using groupby
titanic.groupby("Pclass")["Pclass"].count()

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64

In [104]:
# Using the value_counts method what else could you count?
titanic.groupby(["Pclass", "Survived"])["Survived"].count()

Pclass  Survived
1       0            80
        1           136
2       0            97
        1            87
3       0           372
        1           119
Name: Survived, dtype: int64

In [106]:
# Both size and count can be used in combination with groupby. 
# Whereas size includes NaN values and just provides the number of rows (size of the table), count excludes the missing values. 
# In the value_counts method, use the dropna argument to include or exclude the NaN values.

# REMEMBER
# Aggregation statistics can be calculated on entire columns or rows.

# groupby provides the power of the split-apply-combine pattern.

# value_counts is a convenient shortcut to count the number of entries in each category of a variable.